OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/multiphase/compressibleInterFoam/laminar/cylinder/0/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    sides
    {
        type            calculated;
        value           uniform 300;
    }
    top
    {
        type            calculated;
        value           uniform 300;
    }
    frontAndBack
    {
        type            calculated;
        value           uniform 300;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            calculated;
        value           uniform 300;
    }
}


// ************************************************************************* //
